>>SOURCE FORMAT FREE
IDENTIFICATION DIVISION.
PROGRAM-ID. CobReport.

PROCEDURE DIVISION.
  DISPLAY "CobReport v0.0.1".
  STOP RUN.

END PROGRAM CobReport.
